---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsWinderStyle
source: html/e091ab54-3d02-665b-1637-90d107e6e5a5.htm
---
# Autodesk.Revit.DB.Architecture.StairsWinderStyle

The calculation method for the layout of the winder run steps.

## Syntax (C#)
```csharp
public enum StairsWinderStyle
```